export const differences = {
    one: 'Курс начинается с основных принципов программирования, включая переменные, условия, циклы и функции на языке Python. Студенты узнают, как создавать программы, решающие различные задачи, начиная с простых и постепенно переходя к более сложным алгоритмам.',
    two: 'В рамках курса студенты будут активно применять полученные знания на практике через выполнение различных проектов. От создания игр и веб-приложений до анализа данных и автоматизации задач, каждый проект предоставляет' ,
    three:
      'Преподаватели и наставники будут доступны для оказания помощи студентам на протяжении всего курса. Каждый студент получит обратную связь по своим проектам и заданиям, что поможет им не только понять свои ошибки, но и продвигаться вперед в освоении языка программирования Python.'

  }