// questions.js
const level1Questions = [
    {
      question: 'Какая столица России?',
      options: ['Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург'],
      correctAnswer: 'Москва',
    },
    {
      question: 'Какое самое большое озеро в мире?',
      options: ['Каспийское море', 'Байкал', 'Виктория', 'Мичиган'],
      correctAnswer: 'Виктория',
    },
    {
      question: 'Какой год начала Первой мировой войны?',
      options: ['1914', '1917', '1939', '1945'],
      correctAnswer: '1914',
    },
    {
      question: 'Кто написал "Война и мир"?',
      options: ['Лев Толстой', 'Федор Достоевский', 'Иван Тургенев', 'Александр Солженицын'],
      correctAnswer: 'Лев Толстой',
    },
    // Другие вопросы...
  ];
  
  const level2Questions = [
    {
      question: 'Как называется химический элемент с символом "O"?',
      options: ['Оксиген', 'Октан', 'Озон', 'Олово'],
      correctAnswer: 'Оксиген',
    },
    {
      question: 'Сколько костей в составе человеческого скелета?',
      options: ['206', '208', '210', '212'],
      correctAnswer: '206',
    },
    {
      question: 'Какая планета считается красной планетой?',
      options: ['Марс', 'Венера', 'Юпитер', 'Сатурн'],
      correctAnswer: 'Марс',
    },
  ];
  
  const level3Questions = [
    {
      question: 'Какое наибольшее число находится на обычной шкале термометра?',
      options: ['100', '200', '300', '400'],
      correctAnswer: '100',
    },
    {
      question: 'Какая страна является родиной романтизма?',
      options: ['Германия', 'Франция', 'Англия', 'Италия'],
      correctAnswer: 'Германия',
    },
    {
      question: 'Кто написал "Гарри Поттера"?',
      options: ['Дж. К. Роулинг', 'Джон Толкин', 'Стивен Кинг', 'Джордж Мартин'],
      correctAnswer: 'Дж. К. Роулинг',
    },
  ];
  
  const level4Questions = [
    {
      question: 'Как называется крупнейший океан на Земле?',
      options: ['Тихий', 'Атлантический', 'Индийский', 'Северный Ледовитый'],
      correctAnswer: 'Тихий',
    },
    {
      question: 'Сколько континентов на Земле?',
      options: ['7', '5', '6', '8'],
      correctAnswer: '7',
    },
    {
      question: 'Какой газ является основным компонентом воздуха?',
      options: ['Азот', 'Кислород', 'Углекислый газ', 'Аргон'],
      correctAnswer: 'Азот',
    },
  ];
  
  const level5Questions = [
    {
      question: 'Как называется наибольшая планета Солнечной системы?',
      options: ['Юпитер', 'Сатурн', 'Уран', 'Нептун'],
      correctAnswer: 'Юпитер',
    },
    {
      question: 'В каком году человек первый раз высадился на Луну?',
      options: ['1969', '1972', '1961', '1975'],
      correctAnswer: '1969',
    },
    {
      question: 'Сколько дней в високосном году?',
      options: ['366', '365', '364', '363'],
      correctAnswer: '366',
    },
  ];
  
  const level6Questions = [
    {
      question: 'Как называется процесс преобразования жидкости в газ?',
      options: ['Испарение', 'Конденсация', 'Ионизация', 'Эвапорация'],
      correctAnswer: 'Испарение',
    },
    {
      question: 'Какой город является столицей Японии?',
      options: ['Токио', 'Киото', 'Осака', 'Нагоя'],
      correctAnswer: 'Токио',
    },
    {
      question: 'Кто написал "Преступление и наказание"?',
      options: ['Федор Достоевский', 'Лев Толстой', 'Иван Тургенев', 'Александр Пушкин'],
      correctAnswer: 'Федор Достоевский',
    },
  ];
  
  export { level1Questions, level2Questions, level3Questions, level4Questions, level5Questions, level6Questions };
  
  